Repository: Centaur/lua-nginx-module
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: outputs something like this:
zh_cn: 输出象这样:

source: permanent; # nginx config </geshi>
zh_cn: permanent; # nginx配置 </geshi>

source: rather than the original <code>"hello"</code> value.
zh_cn: 而不是原始的 <code>"hello"</code> 值.

source: redirect; # nginx config </geshi>
zh_cn: redirect; # nginx配置</geshi>

source: regardless of the actual request query string.
zh_cn: ，与实际的请求query string无关.

source: resolver 8.8.8.8; # use Google's public DNS nameserver </geshi>
zh_cn: resolver 8.8.8.8; # 使用 Google 的公开 DNS 服务器 </geshi>

source: return a + b; -- return the $sum value normally
zh_cn: return a + b; -- 照常返回 $sum 值

source: return ngx.redirect('/foo'); -- Lua code </geshi>
zh_cn: return ngx.redirect('/foo'); -- Lua代码 </geshi>

source: return ngx.redirect('/foo', ngx.HTTP_MOVED_PERMANENTLY) -- Lua code </geshi>
zh_cn: return ngx.redirect('/foo', ngx.HTTP_MOVED_PERMANENTLY) -- Lua代码 </geshi>

source: s single-line mode (similar to Perl's /s modifier)
zh_cn: s 单行模式 (类似于Perl /s 修饰符)

source: set $a 12; # create and initialize $a
zh_cn: set $a 12; # 创建并初始化 $a

source: set $b ""; # create and initialize $b
zh_cn: set $b ""; # 创建并初始化 $b

source: set $b ''; # create and initialize $b
zh_cn: set $b ''; # 创建并初始化 $b

source: set $diff ''; # we have to predefine the $diff variable here
zh_cn: set $diff ''; # 必须先定义 $diff 变量

source: set $my_var ''; # this line is required to create $my_var at config time
zh_cn: set $my_var ''; # 这一行是必需的，在config期间创建 $my_var

source: sock:settimeout(1000) -- one second timeout
zh_cn: sock:settimeout(1000) -- 1秒超时

source: subpattern names to be repeated, returning the captures in
zh_cn: 子模板的名称重复, 返回的捕捉结果是一个

source: that is, this method will escape argument keys and values according to URI rules and concatenate them together into a complete query string.
zh_cn: 也就是说, 这个方法会根据 URI 规范对参数的key和value进行转义并将其拼接成一个完整的 query string.

source: that writes out <code>88</code>, the sum of <code>32</code> and <code>56</code>.
zh_cn: 输出 <code>88</code>, <code>32</code> 和 <code>56</code>的和.

source: the --enable-utf8 option or else a Lua exception will be thrown.
zh_cn: --enable-utf8 选项编译，否则将抛出Lua异常.

source: the value of <code>ngx.req.get_headers()["Foo"]</code> will be a Lua (array) table such as:
zh_cn: <code>ngx.req.get_headers()["Foo"]</code> 的值是这样的 Lua (数组) table:

source: this option requires
zh_cn: 此选项需要

source: this option requires at least PCRE 8.12.
zh_cn: 此选项需要至少 PCRE 8.12版本.

source: this option should always be used together with the 'o' option.
zh_cn: 此选项总是应于 'o' 选项一起使用.

source: this option was
zh_cn: 此选项在v0.7.14版本中引入

source: this option was first introduced in the v0.7.14 release.
zh_cn: 此选项在 v0.7.14 版本中引入.

source: this requires PCRE 6.0+ or else a Lua exception will be thrown.
zh_cn: 此选项需要 PCRE 6.0+ ，没有将抛出Lua 异常.

source: this requires PCRE to be built with
zh_cn: 此选项要求 PCRE 带

source: to enable the worker-process-level compiled-regex cache
zh_cn: 打开 worker进程级别的正则表达式编译缓存

source: to prevent (temporary) memory leaking within the current request's lifetime.
zh_cn: 以避免在当前请求生命周期中出现（临时的）内存泄漏.

source: u UTF-8 mode.
zh_cn: u UTF-8 模式.

source: where <code>$0</code> referring to the whole substring matched by the pattern and <code>$1</code> referring to the first parenthesized capturing substring.
zh_cn: 其中 <code>$0</code> 指代匹配的整个子串， <code>$1</code> 指代收第一个括号捕捉的子串.

source: where in the latter case, this method will escape argument keys and values according to the URI escaping rule.
zh_cn: 对后一种情况, 本方法会用URI转义规则对key和value进行转义.

source: which is equivalent to
zh_cn: 等价于

source: which is functionally equivalent to
zh_cn: 在功能上等价于

source: which will result in a query string like <code>a=3&b=5&b=6</code>.
zh_cn: 生成的query string是 <code>a=3&b=5&b=6</code>.

source: while
zh_cn: 而

source: will not work as expected.
zh_cn: 以上代码无法正常运行.

source: will produce two new request headers:
zh_cn: 将生成两个请求头:

source: will result in
zh_cn: 的结果是在读取<code>ngx.header.Foo</code>时返回

source: will yield
zh_cn: 将会在响应头中生成

source: will yield the output
zh_cn: 将输出

source: will yield the response body like
zh_cn: 输出

source: will yield:
zh_cn: 将输出:

source: x extended mode (similar to Perl's /x modifier) </geshi>
zh_cn: x 扩展模式 (类似于Perl /x 修饰符) </geshi>

source: yields
zh_cn: 输出

source: yields the output
zh_cn: 输出
